In [3]:
from hossam import load_data
from pandas import concat

In [4]:
강남점 = load_data('shop_강남')
강남점

[data] https://data.hossam.kr/data/lab04/shop_강남.xlsx
[desc] 흩어진 판매 데이터 통합하기(인덱스/메타데이터 없음)
[!] Cannot read metadata

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20      NaN
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

In [5]:
종로점 = load_data('shop_종로')
종로점

[data] https://data.hossam.kr/data/lab04/shop_종로.xlsx
[desc] 흩어진 판매 데이터 통합하기(인덱스/메타데이터 없음)
[!] Cannot read metadata

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard       999  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [8]:
강남점cp = 강남점.copy()
강남점cp['Price'] = 강남점cp['Price'].fillna(8000)
강남점cp

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20   8000.0
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

In [9]:
종로점cp = 종로점.copy()
idx =  종로점cp[종로점cp['Product'] == 'Keyboard'].index[0]
종로점cp.loc[idx, 'Quantity']=9
종로점cp

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard         9  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [11]:
종로점cp = 종로점.copy()
종로점cp['Quantity'] = 종로점cp['Quantity'].replace(999, 9)
종로점cp

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard         9  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [13]:
df_total = concat([강남점cp, 종로점cp], ignore_index=True)
df_total

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20   8000.0
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0
4    B001     Mouse        15   8000.0
5    B002  Keyboard         9  14500.0
6    B003    Webcam        10  30000.0
7    B004     Mouse        18   8000.0